/* -------------------------------------------------------------------------- */
/* Enums */
/* -------------------------------------------------------------------------- */

/* TINTodoStatus */

"OLNMOe" = "狀態"; /* Display Name */

"mQr54o" = "不明";   /* Value: unknown */
"8K78Gu" = "未完成";      /* Value: open */
"HSjTOt" = "已完成"; /* Value: completed */
"1Ncljt" = "已取消";  /* Value: canceled */

/* -------------------------------------------------------------------------- */
/* Types */
/* -------------------------------------------------------------------------- */

/* TINTodo */

"OMXxQN" = "Things 待辦事項"; /* Display Name */

"q1gqw8" = "UUID";      /* Property: uuid */
"LiLlEf" = "標題";     /* Property: title */
"Kw5NWX" = "清單";      /* Property: list */
"R3fuSz" = "何時";      /* Property: when */
"8TjwzE" = "晚上";   /* Property: evening */
"gRh7no" = "否";        /* Property: evening (false value) */
"WHB5qC" = "是";       /* Property: evening (true value) */
"bww4JS" = "提醒";  /* Property: reminder */
"19lPBk" = "完成時限";  /* Property: deadline */
"pp3qBd" = "備註";     /* Property: notes */
"UDIc1x" = "檢查清單"; /* Property: checklist */
"KQzIKq" = "標籤";      /* Property: tags */

/* TINList */

"x7Empa" = "Things 清單"; /* Display Name */

/* -------------------------------------------------------------------------- */
/* Intents */
/* -------------------------------------------------------------------------- */

/* TINAddTodo */

"jUtU4g" = "添加待辦事項"; /* Title */
"1Xn7Aa" = "在 Things 中添加一個新的待辦事項。"; /* Description */

"YmSQDf" = "待辦事項"; /* Parameter: title */
"LHHz9E" = "標題是什麼？"; /* Parameter: title, dialog (Primary) */

"ZlzpNK" = "清單"; /* Parameter: list */
"X4r1DR" = "您要將它加入哪個清單？"; /* Parameter: list, dialog (DisambiguationSelection) */

"unnTAD" = "何時"; /* Parameter: when */
"VkNe0C" = "想要何時開始？"; /* Parameter: when, dialog (Primary) */

"gaX3hF" = "晚上"; /* Parameter: evening */
"b10WOZ" = "在晚上嗎？"; /* Parameter: evening, dialog (Primary) */
"0fPzah" = "否"; /* Parameter: evening (false value) */
"KWUIrj" = "是"; /* Parameter: evening (true value) */

"AeXgbS" = "提醒時間"; /* Parameter: reminderTime */
"3Nk1Yl" = "您想在何時收到提醒？"; /* Intent TINAddTodo -> Parameter: reminderTime, dialog (Primary) */

"BzuFhi" = "完成時限"; /* Parameter: deadline */
"xi8sPe" = "完成時限為何時？"; /* Parameter: deadline, dialog (Primary) */

"NYFM84" = "標籤"; /* Parameter: tags */
"l0xizU" = "要添加哪個標籤？"; /* Parameter: tags, dialog (Primary) */

"tfx4bF" = "狀態"; /* Parameter: status */
"sS5Ms4" = "何種狀態？"; /* Parameter: status, dialog (DisambiguationSelection) */

"DZdOjf" = "在 Things 中編輯"; /* Parameter: editInThings */
"W5N6Yo" = "是否要開啟 Things 以編輯這個待辦事項？"; /* Parameter: editInThings, dialog (Primary) */
"bRVelp" = "否"; /* Parameter: editInThings (false value) */
"ZSGv41" = "是"; /* Parameter: editInThings (true value) */

"o8AABR" = "備註"; /* Parameter: notes */
"pjyLst" = "您想添加哪些備註？"; /* Parameter: notes, dialog (Primary) */

"uHRvWn" = "檢查清單"; /* Parameter: checklist */
"VIitBC" = "您想添加哪些檢查清單項目？"; /* Parameter: checklist, dialog (Primary) */

"6nhwMl" = "已添加${todoTitle} 。"; /* Response Code: success (voice-only dialog) */
"NKVz1k" = "已添加${todoTitle} 。"; /* Response Code: success (printed dialog) */
"sr1IRz" = "添加待辦事項時發生錯誤。"; /* Response Code: failure (voice-only dialog) */
"LyHwKB" = "添加待辦事項時發生錯誤。"; /* Response Code: failure (printed dialog) */
"j6LE7B" = "已添加這個待辦事項。"; /* Response Code: successEmptyTitle (voice-only dialog) */
"rNH42i" = "已添加這個待辦事項。"; /* Response Code: successEmptyTitle (printed dialog) */

"Lj80pA" = "待辦事項標題"; /* Response Parameter: todoTitle */
"Br1Zm3" = "待辦事項"; /* Response Parameter: todo */

"9LylOv" = "添加${title}"; /* Shortcuts App: title,list,status,when,deadline,notes,checklist,tags,editInThings (title) */
"wBHz6x" = "添加${title}"; /* Shortcuts App: title,notes,checklist,when,deadline,tags,list,status,editInThings,reminderTime,evening (title) */

/* TINShowTodo */

"jANQXX" = "顯示待辦事項"; /* Title */
"JdIZ8x" = "在 Things 中顯示特定的待辦事項。"; /* Description */

"WAIq5F" = "待辦事項"; /* Parameter: todo */

"YIbDyi" = "顯示${todo}"; /* Shortcuts App: todo (title) */

/* TINShowList */

"ptz6wF" = "顯示清單"; /* Title */
"xo5PDm" = "在 Things 中顯示特定清單"; /* Description */

"RW2Nyz" = "清單"; /* Parameter: list */
"V1nlDA" = "哪個清單？"; /* Parameter: list, dialog (DisambiguationSelection) */

"3hu2WN" = "依標籤篩選"; /* Parameter: filterByTags */
"HQ0TAS" = "哪個標籤？"; /* Parameter: filterByTags, dialog (DisambiguationSelection) */

"vKhBKF" = "顯示${list}"; /* Shortcuts App: list,filterByTags (title) */
"poYHAf" = "顯示${list}"; /* Shortcuts App: list (title) */

"mlANgr" = "顯示${list}"; /* Suggestions: list (title) */

/* TINRunThingsURL */

"lW66Em" = "跑 Things URL"; /*  Title */
"keYeZ9" = "在背景跑 Things URL。"; /*  Description */

"uPeA3l" = "Things URL"; /*  Parameter: url */
"oTrE0f" = "請給我 URL 地址？"; /* Intent TINRunThingsURL -> Parameter: url, dialog (Primary) */

"Xq4kUL" = "已成功跑了 URL。"; /*  Response Code: success (voice-only dialog) */
"DDKH5R" = "已成功跑了這個URL。"; /*  Response Code: success (printed dialog) */
"a4aEdR" = "跑 URL 時出問題。"; /*  Response Code: failure (voice-only dialog) */
"LNTEqX" = "跑 URL 時發生錯誤。"; /*  Response Code: failure (printed dialog) */

"uth0Px" = "跑 Things URL ${url}"; /*  Shortcuts App: url (title) */

/* INAddTasks (customized system intent) */

"3s4Pq7" = "添加任務"; /* Title */
"J4CdGj" = "使用內建功能將待辦事項添加到 Things 中。"; /* Intent AddTasks -> Description */

"IF3OZi" = "任務清單"; /* Parameter: targetTaskList */
"uNB8yE" = "標題"; /* Parameter: taskTitles */
"2x4fQs" = "Spatial Event Trigger"; /* Parameter: spatialEventTrigger */
"itSKVK" = "Temporal Event Trigger"; /* Parameter: temporalEventTrigger */

"sLae48" = "打開 Things"; /* Suggestions:  (title) */
